QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Rc663_Reg.h
/** \brief Tx Symbol 2 Register.
*
* Contains Symbol definition for Symbol 2.
*/
#define PHHAL_HW_RC663_REG_TXSYM2               0x51U

/** \brief Tx Symbol 3 Register.
*
* Contains Symbol definition for Symbol 3.
*/
#define PHHAL_HW_RC663_REG_TXSYM3               0x52U

/** \brief Transmitter Symbol 0 + Symbol 1 Length Register.
*
* Contains Length of Transmitter Symbol 0 + Symbol 1.
*/
#define PHHAL_HW_RC663_REG_TXSYM10LEN           0x53U

/** \brief Transmitter symbol 3 + symbol 2 length register.
*
* Contains No. of Valid bits in Tx Symbol 2 and Tx Symbol 3 registers.
*/
#define PHHAL_HW_RC663_REG_TXSYM32LEN           0x54U

/** \brief Symbol 0 and 1 Register.
*
* Configure Burst-control of both symbols.
*/
#define PHHAL_HW_RC663_REG_TXSYM10BURSTCTRL     0x55U

/** \brief Symbol 0 and 1 Register.
*
* Configure Modulation Register of both symbols.
*/
#define PHHAL_HW_RC663_REG_TXSYM10MOD           0x56U

/** \brief Transmitter symbol 3 + symbol 2 modulation register.
*
* Configures Miller encoding, Pulse type and Envelope type.
*/
#define PHHAL_HW_RC663_REG_TXSYM32MOD           0x57U

/** \brief Receiver bit modulation register.
*
* Contains Receiver data configurations.
*/
#define PHHAL_HW_RC663_REG_RXBITMOD             0x58U

/** \brief Receiver end of frame symbol register.
*
* This Register defines the pattern of the EOF symbol.
*/
#define PHHAL_HW_RC663_REG_RXEOFSYM             0x59U

/** \brief Receiver synchronisation value high register.
*
* Defines the high byte of the Start Of Frame (SOF) pattern, which must
* be in front of the receiving data.
*/
#define PHHAL_HW_RC663_REG_RXSYNCVAlH           0x5AU

/** \brief Receiver synchronisation value low register.
*
* Defines the low byte of the Start Of Frame (SOF) Pattern, which must
* be in front of the receiving data.
*/
#define PHHAL_HW_RC663_REG_RXSYNCVAlL           0x5BU

/** \brief Receiver synchronisation mode register.
*
* Contains Rx sync values.
*/
#define PHHAL_HW_RC663_REG_RXSYNCMOD            0x5CU

/** \brief Receiver modulation register.
*
* Contains Reciever configuration registers.
*/
#define PHHAL_HW_RC663_REG_RXMOD                0x5DU

/** \brief Receiver Correlation Register.
*
* Contains Correlation Frequency, Correlation Speed and Correlation Length.
*/
#define PHHAL_HW_RC663_REG_RXCORR               0x5EU

/** \brief Calibration register of the receiver.
*
* Contains Fabrication calibration of the receiver.
*/
#define PHHAL_HW_RC663_REG_RXSVETTE             0x5FU

/** \brief DAC value Register.
*
* Contains DAC Value.
*/
#define PHHAL_HW_RC663_REG_DACVAL               0x64U

/** \brief Test mode Register.
*
* Contains Test Level enable and Test mode configuration.
*/
#define PHHAL_HW_RC663_REG_TESTMOD              0x66U

/** \brief Analog Xtal register.
*
* Contains Xtal mode and Xtal bypassreg.
*/
#define PHHAL_HW_RC663_REG_ANAXTAL              0x71U

/** \brief EPCv2 mode Register.
*
* Enables or Disables Testmode Rx and EPCv2 mode.
*/
#define PHHAL_HW_RC663_REG_SIGPROTEST           0x72U

/** \brief Version Register.
*
* Contains IC Version and Subversion.
*/
#define PHHAL_HW_RC663_REG_VERSION              0x7FU

/** \name Command Register Contents (0x00)
*/
/*@{*/
#define PHHAL_HW_RC663_BIT_STANDBY              0x80U   /**< Standby bit; If set, the IC transits to standby mode. */
#define PHHAL_HW_RC663_CMD_IDLE                 0x00U   /**< No action; cancels current command execution. */
#define PHHAL_HW_RC663_CMD_LPCD                 0x01U   /**< Low Power Card Detection. */
#define PHHAL_HW_RC663_CMD_LOADKEY              0x02U   /**< Reads a key from the FIFO buffer and puts it into the key buffer. */
#define PHHAL_HW_RC663_CMD_MFAUTHENT            0x03U   /**< Performs the MIFARE product authentication (to read and write of MIFARE products only). */
#define PHHAL_HW_RC663_CMD_ACKREQ               0x04U   /**< Performs a Query, a Ack and a Req-Rn for EPC V2. */
#define PHHAL_HW_RC663_CMD_RECEIVE              0x05U   /**< Activates the receiver circuitry. */
#define PHHAL_HW_RC663_CMD_TRANSMIT             0x06U   /**< Transmits data from the FIFO buffer to Card. */
#define PHHAL_HW_RC663_CMD_TRANSCEIVE           0x07U   /**< Like #PHHAL_HW_RC663_CMD_TRANSMIT but automatically activates the receiver after transmission is finished. */
#define PHHAL_HW_RC663_CMD_WRITEE2              0x08U   /**< Gets one byte from FIFO buffer and writes it to the internal EEPROM. */
#define PHHAL_HW_RC663_CMD_WRITEE2PAGE          0x09U   /**< Gets up to 64 Bytes from FIFO buffer and writes it to the EEPROM. */
#define PHHAL_HW_RC663_CMD_READE2               0x0AU   /**< Reads data from EEPROM and puts it into the FIFO buffer. */
#define PHHAL_HW_RC663_CMD_LOADREG              0x0CU   /**< Reads data from EEPROM and initializes the registers. */
#define PHHAL_HW_RC663_CMD_LOADPROTOCOL         0x0DU   /**< Reads data from EEPROM and initializes the registers needed for a protocol change. */
#define PHHAL_HW_RC663_CMD_LOADKEYE2            0x0EU   /**< Copies a MIFARE product key from the EEPROM into the key buffer. */
#define PHHAL_HW_RC663_CMD_STOREKEYE2           0x0FU   /**< Stores a MIFARE product key into the EEPROM. */
#define PHHAL_HW_RC663_CMD_SOFTRESET            0x1FU   /**< Resets the IC. */
#define PHHAL_HW_RC663_MASK_COMMAND             0x1FU   /**< Mask for Command-bits. */
/*@}*/

/** \name Host-Control Register Contents (0x01)
*/
/*@{*/
#define PHHAL_HW_RC663_BIT_REGEN                0x80U
#define PHHAL_HW_RC663_BIT_BUSHOST              0x40U
#define PHHAL_HW_RC663_BIT_BUSSAM               0x20U
#define PHHAL_HW_RC663_MASK_SAMINTERFACE        0x0CU
/*@}*/

/** \name FIFO-Control Register Contents (0x02)
*/
/*@{*/
#define PHHAL_HW_RC663_BIT_FIFOSIZE             0x80U
#define PHHAL_HW_RC663_BIT_HIALERT              0x40U
#define PHHAL_HW_RC663_BIT_LOALERT              0x20U
#define PHHAL_HW_RC663_BIT_FLUSHFIFO            0x10U
#define PHHAL_HW_RC663_BIT_WATERLEVEL_HI        0x04U
#define PHHAL_HW_RC663_MASK_FIFOLENGTH_HI       0x03U
/*@}*/

